app/controllers/microposts_controller.rb

  def index
    @microposts = Micropost.all
---
SELECT * FROM `microposts` ORDER BY created_at DESC

  def show
    @micropost = Micropost.find(params[:id])
---
SELECT * FROM `microposts` WHERE (`microposts`.`id` = 250) ORDER BY created_at DESC

  def edit
    @micropost = Micropost.find(params[:id])
---
SELECT * FROM `microposts` WHERE (`microposts`.`id` = 1)

  def create

    @micropost = current_user.microposts.build(params[:micropost])
    respond_to do |format|
      if @micropost.save
---
INSERT INTO `microposts` (`created_at`, `user_id`, `updated_at`, `content`) VALUES('2012-12-15 06:01:05', 3, '2012-12-15 06:01:05', 'Nothing much')

  def update
    @micropost = Micropost.find(params[:id])

    respond_to do |format|
      if @micropost.update_attributes(params[:micropost])
---
SELECT * FROM `microposts` WHERE (`microposts`.`id` = 1)
UPDATE `microposts` SET `user_id` = 0, `content` = 'f', `updated_at` = '2012-12-13 08:09:13' WHERE `id` = 2

  def destroy
    @micropost = Micropost.find(params[:id])
    @micropost.destroy
---
SELECT * FROM `microposts` WHERE (`microposts`.`id` = 306) ORDER BY created_at DESC
DELETE FROM `microposts` WHERE `id` = 306