app/controllers/users_controller.rb

SELECT * FROM `users` LIMIT 0, 30
SELECT count(*) AS count_all FROM `users`
---
  def index
    @users = User.paginate(:page => params[:page])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `microposts` WHERE (`microposts`.user_id = 1) ORDER BY created_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `microposts` WHERE (`microposts`.user_id = 1)
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])

INSERT INTO `users` (`updated_at`, `salt`, `created_at`, `remember_token`, `encrypted_password`, `name`, `email`) VALUES('2012-12-14 05:52:59', '0f14bcc49f7fb25c5428a173a2a82939b9ba0dbc6ffd32ff1075c5a063acbdb1', '2012-12-14 05:52:59', NULL, '1f6b6eae5175a422e267f4a3ce815c1ac43b43b9d81955e946d3765f73a33358', 'Bharath', 'mgbharath@ymailc.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `encrypted_password` = '7e8100d82c2924ac2c553937c51fba65661df269ae16b0505260c2f2fb6ffa49', `updated_at` = '2012-12-14 07:11:08', `salt` = '69577cf37df37a9fdf26bb003ff8e9d4e81f534f43620554b827ce5fd0e76104' WHERE `id` = 16
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 3)
---
  def following
    @title = "Following"
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 3)
---
  def followers
    @title = "Followers"
    @user = User.find(params[:id])